# ----
# TAPS
# ----

tap 'caskroom/cask'
tap 'caskroom/fonts'

# -----
# BREWS
# -----

# Core
brew 'coreutils'
brew 'moreutils'
brew 'findutils'
brew 'mas'
brew 'zsh'
brew 'fish'
brew 'm-cli'

# Languages
brew 'ruby-build'
brew 'rbenv'
brew 'node'
brew 'yarn'
brew 'python'
brew 'python3'

# Utilities
brew 'ack'
brew 'dark-mode'
brew 'exa'
brew 'fd'
brew 'git'
brew 'lolcat'
brew 'mackup'
brew 'openssl'
brew 'grc'
brew 'ssh-copy-id'
brew 'stow'
brew 'svgo'
brew 'thefuck'
brew 'tree'
brew 'wget'
brew 'youtube-dl'

# -----
# CASKS
# -----

# Essentials
cask '1password'
cask 'alfred'
cask 'awareness'
cask 'bartender'
cask 'bettertouchtool'
cask 'contexts'
cask 'dash'
cask 'karabiner-elements'
cask 'path-finder'
cask 'spotify'

# Developer
cask 'iterm2'
cask 'hyper'
cask 'rubymine'
cask 'visual-studio-code'
cask 'virtualbox'

# Filesystem
cask 'dropbox'

# Work
cask 'ccmenu'
cask 'google-drive-file-stream'
cask 'launchrocket'

# Others
cask 'google-chrome'
cask 'firefox'
cask 'opera'
cask 'beaker-browser'
cask 'macdown'
cask 'numi'
cask 'slack'
cask 'itsycal'
cask 'station'
cask 'sip'
cask 'keybase'
cask 'vlc'

# Fonts
cask "caskroom/fonts/font-droidsansmono-nerd-font-mono"
cask "caskroom/fonts/font-hasklig"
cask "caskroom/fonts/font-hermit-nerd-font"
cask "caskroom/fonts/font-hermit-nerd-font-mono"
cask "caskroom/fonts/font-roboto-mono-for-powerline"
cask "caskroom/fonts/font-source-code-pro"
cask "caskroom/fonts/font-sourcecodepro-nerd-font-mono"

# ---
# MAS
# ---

mas 'Quiver', id: 866773894
mas 'AntiRSI', id: 442007571
mas 'Time Out', id: 402592703
mas 'Tooth Fairy', id: 1191449274
mas 'Airmail 3', id: 918858936
