# ----
# TAPS
# ----

tap 'caskroom/cask'
tap 'caskroom/fonts'

# -----
# BREWS
# -----

# Core
brew 'coreutils'
brew 'moreutils'
brew 'findutils'
brew 'mas'
brew 'zsh'
brew 'fish'

# Ruby setup
brew 'ruby-build'
brew 'rbenv'

# Python Setup
# brew install python
# brew install python3

# Utilities
brew 'ack'
brew 'dark-mode'
brew 'fd'
brew 'git'
brew 'lolcat'
brew 'openssl'
brew 'ssh-copy-id'
brew 'stow'
brew 'svgo'
brew 'thefuck'
brew 'tree'
brew 'wget'
brew 'youtube-dl'

# -----
# CASKS
# -----

# Essentials
cask '1password'
cask 'awareness'
cask 'bartender'
cask 'bettertouchtool'
cask 'contexts'
cask 'dash'
cask 'karabiner-elements'
cask 'path-finder'
cask 'spotify'

# Developer
cask 'iterm2'
cask 'visual-studio-code'

# Filesystem
cask 'dropbox'
cask 'google-drive-file-stream'

# Others
cask 'google-chrome'
cask 'firefox'
cask 'beaker-browser'
cask 'macdown'
cask 'mplayerx'
cask 'numi'
cask 'slack'
cask 'itsycal'
cask 'station'
cask 'keybase'

# Fonts
cask "caskroom/fonts/font-droidsansmono-nerd-font-mono"
cask "caskroom/fonts/font-hasklig"
cask "caskroom/fonts/font-source-code-pro"
cask "caskroom/fonts/font-sourcecodepro-nerd-font-mono"

# ---
# MAS
# ---

mas 'Quiver', id: 866773894
mas 'AntiRSI', id: 442007571
mas 'Tooth Fairy', id: 1191449274
